[frmMain]
mnuLanguage.Caption=Sprache(Language)

pmnuExitTheSystem.Caption=Verlassen Sie das System

mnuSystemSettings.Caption=Einstellungen des Systems
mnuParameterSetting.Caption=Einstellung der Parameter
mnuBootUp.Caption=Starten Sie
mnuExitTheSystem.Caption=Verlassen Sie das System

mnuReportTools.Caption=Werkzeuge zur Berichterstattung
mnuReportDesign.Caption=Entwurf des Berichts

mnuPrintLog.Caption=View print log


mnuJsonTools.Caption=Tool zur Validierung von JSON(bejson.com)
mnuBase64.Caption=Base64 und Bildkonvertierung
mnuUrlEncode.Caption=Kodierung der URL
mnuSSLTools.Caption=Tool zur Konvertierung des Zertifikats SSL
mnuOpenTheRootDirectory.Caption=Öffnen Sie das Wurzelverzeichnis
mnuOpenReportDirectory.Caption=Öffnen Sie Berichtverzeichnis
mnuOpenLogDirectory.Caption=Log-Verzeichnis öffnen
mnuOpenTheOutputfileDirectory.Caption=Öffnen Sie das Ausgabedateiverzeichnis
mnuWindowDisplay.Caption=Anzeige des Fensters
mnuHttpPrint.Caption=HTTP Drucken
mnuMqttPrint.Caption=Drucken von Mqtt
mnuCamera.Caption=Kamera
mnuIdCard.Caption=ID
mnuGridreport.Caption=Gridreport
mnuFastreport.Caption=Fastreport
mnuReportmachine.Caption=Reportmachine
mnuSystemHelp.Caption=Hilfe im System
mnuAboutUs.Caption=Über uns

ts_http_print.Caption=HTTP Drucken
lblPort.Caption=Port
rb_print.Caption=Drucken
rb_Preview.Caption=Vorschau
ButtonStart.Caption=Inbetriebnahme
ButtonStop.Caption=Hör auf!

ts_mqtt_print.Caption=Drucken von Mqtt
gb_mqtt.Caption=Server Mqtt
lbl_mqtt_server_address.Caption=Adresse
lbl_mqtt_server_port.Caption=Port
lbl_mqtt_server_username.Caption=Name des Benutzers
lbl_mqtt_server_userpwd.Caption=Passwort
lbl_mqtt_server_subscribe_topic.Caption=Themen abonnieren
lbl_mqtt_server_print_verification_code.Caption=Code der Druckprüfung
ButtonStart_mqtt.Caption=Inbetriebnahme
ButtonStop_mqtt.Caption=Hör auf!

ts_camera.Caption=Kamera
lbl_camera_device_list.Caption=Liste der Ausrüstung
lbl_camera_resolution.Caption=Auflösung der Macht
btn_open_camera.Caption=Starten Sie die Kamera
btn_close_camera.Caption=Schalten Sie die Kamera aus.
chk_auto_open_camera.Caption=Kamera automatisch starten
chk_pal_b.Caption=Verhindern Sie Flash-Screen
chk_auto_top.Caption=Top Form (immer oben)

ts_idcard.Caption=ID
lbl_idcard_name.Caption=vollständiger Name
lbl_idcard_sex.Caption=Geschlecht
lbl_idcard_nation.Caption=Nation
lbl_idcard_birthday.Caption=Datum der Geburt
lbl_idcard_id.Caption=Nummer der ID
lbl_idcard_org.Caption=Organisation der Unterzeichnung und Ausstellung
lbl_idcard_addr.Caption=Adresse
lbl_idcard_begin.Caption=Beginn der Gültigkeit
lbl_idcard_end.Caption=Ende der Gültigkeit
lbl_idcard_type.Caption=Art der Ausrüstung
btn_idcard_read.Caption=lesen
lbl_idcard_msg.Caption=Hinweise zur Nachricht:

[frmAbout]
btnOk.Caption=bestimmen
Caption=Über

[LanguageString]
ini_NeedRegister=Zu viele Druckzeiten, starten Sie bitte das Plug-in neu oder kaufen Sie OEM-Version
ini_NoToken=Der Token-Wert existiert nicht
ini_ReadIdCardError=Eingabeaufforderung: Kartenlesen fehlgeschlagen!
ini_GetPrinterList=Liste der Drucker erhalten
ini_CreateDir=Verzeichnis erstellen
ini_FailPleaseCheck=Fehler, bitte überprüfen
ini_PrintFailPleaseCheck=Drucken fehlgeschlagen, bitte überprüfen
ini_ReportFileNotExist=Die Berichtsdatei existiert nicht
ini_DownLoadError=Fehler beim Download
ini_JsonFormatError=Fehler beim JSON-Format
ini_PrintingTimeoutPleaseCheck=Druckzeit, bitte überprüfen
ini_PictureFormatError=Das Bildformat ist nicht korrekt
ini_PdfFileNotExist=Pdf-Datei existiert nicht
ini_PicFileNotExist=Pic-Datei existiert nicht
ini_This=Die
ini_NotSupport=Ich werde es nicht unterstützen.
ini_InterfaceCallFailed=Verbindungsaufruf fehlgeschlagen
ini_CameraNotActivated=Kamera nicht aktiviert
ini_SelectFolder=Ordner auswählen
ini_MinutesMustBeAnInteger=Minuten müssen eine ganze Zahl sein
ini_MinutesMustBeGreaterThanZero=Minuten müssen größer als Null sein.
ini_SelfStartingClientNameCannotBeEmpty=Der selbststartende Client-Name kann nicht leer sein


ini_PdfFileCannotOpen=Pdf-Datei kann nicht geöffnet werden
ini_LicenseKeyInvalid=Ungültiger Lizenzschlüssel


ini_PicFileCannotOpen=Pic-Datei kann nicht geöffnet werden
ini_UnableInitializePrinter=Drucker kann nicht initialisiert werden
ini_PicPrint=Drucken von Bildern
ini_PaperSize=Größe des Papiers
ini_CustomMM=benutzerdefiniert(MM)
ini_Width=Breite
ini_Height=Höhe
ini_PrintingDirection=Richtung des Druckens
ini_landscape=Quer
ini_portrait=vertikal
ini_MarginMM=Margen(MM)
ini_Left=Links
ini_Right=Rechts
ini_Top=obere
ini_Bottom=niedriger
ini_Center=Mitte
ini_VerticalPos=Vertikale Lage
ini_HorizontalPos=Horizontale Lage
ini_Copys=Anzahl der Exemplare
ini_DocumentTitle=Titel des Dokuments
ini_PrinterName=Name des Druckers
ini_PageZoom=Zoom der Seite
ini_Normal=Bestimmen Sie die Druckgröße aus dem Originalbild DPI (d.h. erstellen Sie eine echte Größenkopie)
ini_FitToPage=Stretch the image to passe the page while respecting its scale
ini_FitToPageStretch=Stretch the image to passe the page, ignoring scale
ini_FillPage=Streckt das Bild, um die ganze Seite zu füllen (basierend auf ihrer Skala)
ini_SpecifiedSize=Drucken mit der absoluten Größe, die durch die absoluten Breite- und Höhenparameter bestimmt ist
ini_MultiplePages=Drucken von Bildern (Postern) auf mehreren Seiten mit Zahlen, die durch absolute Breite und absolute Höhenparameter angegeben sind
ini_SpecWidth=Absolute Breite
ini_SpecHeight=Absolute Höhe
ini_LoadPic=Bilder laden
ini_ConfirmPrinting=Bestätigen des Druckes




ini_PrintLog=Protokoll drucken
ini_Date=Datum
ini_Refresh=Aktualisieren
ini_OpenLogDirectory=Log-Verzeichnis öffnen
ini_OpenOutputFileDirectory=Öffnen Sie das Ausgabedateiverzeichnis
ini_ViewCustomFile=Benutzerdefinierte Datei anzeigen
ini_LogList=Liste der Protokolle
ini_LogContent=Inhalt des Logs
ini_PdfFile=Pdf Datei
ini_Directory=Katalog
ini_NotExist=nicht-vorhanden




ini_ReportDesign=Entwurf des Berichts
ini_DoubleClickToOpenTheReportFile=Doppelklicken Sie, um die Berichtdatei zu öffnen
ini_NewlyAdded=hinzufügen zu
ini_Modify=ändern
ini_Delete=Löschen
ini_Copy=Kopie
ini_ReportDoesNotExist=Bericht existiert nicht
ini_To=Zu
ini_Error=Fehler
ini_InTheListBelow_selectTheReportFileYouWantToModify=Wählen Sie in der untenstehenden Liste die Berichtdatei aus, die Sie ändern möchten.
ini_TestReport=Bericht der Prüfung
ini_AreYouSureYouWantToDelete=Sind Sie sicher, dass Sie löschen möchten
ini_DeleteConfirmation=Bestätigung löschen
ini_YouHaveChosenNotToDelete=Sie haben nicht gelöscht
ini_ReportNameEn=Name des Berichts
ini_ReportNameAlias=Report name (alias)
ini_VersionNumber=Nummer der Version
ini_FileNameSuffixMustBe=Suffix name must be
ini_Currently=Derzeit
ini_TheFileNameAlreadyExists=Der Dateiname existiert bereits
ini_ReportInfo=Informationen berichten




ini_NoJsonFile=Die JSON-Datei fehlt
ini_PrintErrorJsonError=Das Drucken fehlgeschlagen, JSON-Formatfehler
ini_MustBe=Muss sein.
ini_Or=vielleicht
ini_ReportName=Name des Berichts
ini_CannotBeEmpty=Kann nicht leer sein
ini_MustBeIntOrFloat=Muss ein Dezimal- oder ganzzahliger Typ sein
ini_DeleteLocalReportFile=Lösche lokale Berichtdatei
ini_DownLoadReportFileToLocal=Remote-Bericht auf lokaler Ebene herunterladen
ini_DownLoadReportFileError=Fehler beim Herunterladen der Berichtdatei
ini_DownLoadComplete=Download abgeschlossen
ini_EditLocalReportVersion=Ändern Sie die Versionsnummer des lokalen Berichts
ini_CreateReportFile=Datei erstellen
ini_PrintCopys=Anzahl der gedruckten Exemplare
ini_MustBeInt=Muss ein ganzzahliger Typ sein
ini_MustBeGreaterThanOrEqualTo=Muss größer oder gleich Null sein
ini_DetermineIfThePrinterExists=Bestimmen Sie, ob der Drucker existiert
ini_Printer=Drucker
ini_NotExistPayAttentionToCaseAndSpace=Nein, bitte achten Sie auf Koffer und Platz.
ini_SetRightOffset=Rechter Versatz setzen
ini_MustBeFloat=Muss ein Fließkomma sein
ini_SetBottomOffset=Set base offset
ini_MustBeOneOrZero=Muss 1 oder 0 sein
ini_SetComponent=Set part box
ini_Component=Komponentenbox (Komponentenbox)
ini_ControlToArrayError=Fehler beim Konvertieren der Steuerung in Array
ini_LoadPicError=Fehler beim Laden des Bildes
ini_FormatError=Falsches Format
ini_Parameter=Parameter
ini_ParameterToArrayError=Fehler beim Konvertieren von Parametern in Array
ini_Field=Feld
ini_FieldToArrayError=Fehler beim Konvertieren von Field in array
ini_AFieldToArrayError=Fehler beim Konvertieren von AField in array
ini_BFieldToArrayError=Fehler beim Konvertieren von BField in array
ini_CFieldToArrayError=Fehler beim Konvertieren von CField in array
ini_DFieldToArrayError=Fehler beim Konvertieren von DField in array
ini_EFieldToArrayError=Fehler beim Konvertieren von EField in array
ini_FFieldToArrayError=Fehler beim Konvertieren von FField in array
ini_GFieldToArrayError=Fehler beim Konvertieren von GField in array
ini_HFieldToArrayError=Fehler beim Konvertieren von HField in array
ini_IFieldToArrayError=Fehler beim Konvertieren von IField in array
ini_JFieldToArrayError=Fehler beim Konvertieren von JField in array
ini_DataRow=Zeile der Daten
ini_DataToArrayError=Fehler beim Konvertieren von DATA in Array
ini_ADataToArrayError=Fehler beim Konvertieren von ADATA in Array
ini_BDataToArrayError=Fehler beim Konvertieren von BDATA in Array
ini_CDataToArrayError=Fehler beim Konvertieren von CDATA in Array
ini_DDataToArrayError=Fehler beim Konvertieren von DDATA in Array
ini_EDataToArrayError=Fehler beim Konvertieren von EDATA in Array
ini_FDataToArrayError=Fehler beim Konvertieren von FDATA in Array
ini_GDataToArrayError=Fehler beim Konvertieren von GDATA in Array
ini_HDataToArrayError=Fehler beim Konvertieren von HDATA in Array
ini_IDataToArrayError=Fehler beim Konvertieren von IDATA in Array
ini_JDataToArrayError=Fehler beim Konvertieren von JDATA in Array
ini_SetOffsetValue=Setzt den Offset-Wert
ini_SetPrinterName=Name des Druckers festlegen
ini_ExportFileYes=Möchten Sie die Datei ja exportieren
ini_ExportFileName=Dateiname exportieren
ini_ExportComplete=Export abgeschlossen
ini_PreviewComplete=Vorschau abgeschlossen
ini_PrintComplete=Abgeschlossener Druck
ini_LoadReport=Bericht laden
ini_ADataToArraySuccess=AData erfolgreich in Array konvertiert
ini_BDataToArraySuccess=BData erfolgreich in Array konvertiert
ini_CDataToArraySuccess=CData erfolgreich in Array konvertiert
ini_DDataToArraySuccess=DData erfolgreich in Array konvertiert
ini_EDataToArraySuccess=EData erfolgreich in Array konvertiert
ini_FDataToArraySuccess=FData erfolgreich in Array konvertiert
ini_GDataToArraySuccess=GData erfolgreich in Array konvertiert
ini_HDataToArraySuccess=HData erfolgreich in Array konvertiert
ini_IDataToArraySuccess=IData erfolgreich in Array konvertiert
ini_JDataToArraySuccess=JData erfolgreich in Array konvertiert



ini_NoClientID=Es gibt keinen Wert für ClientID
ini_ClientIDEmpty=ClientID kann nicht leer sein
ini_PrinteridWrong=Printerid ist nicht richtig
ini_PrinterpwdWrong=Printerpwd ist falsch
ini_MethodWrong=Falsche Methode
ini_PingSuccessful=Ping erfolgreich
ini_PingTimeout=Ping Timeout
ini_ConnectionResults=Ergebnisse der Verbindung
ini_subscribeResultMessageID=Abonnement-Ergebnis, Nachrichtenkennung
ini_UnsubscribeResultMessageID=Abmelden des Ergebnisses, Nachrichtenkennung
ini_Received_release_confirmation_QoS_1_message_ID=Erhaltene Release-Bestätigung QoS 1, Message ID
ini_Receive_release_confirmation_step_1_of_QoS_2_message_ID=Erhalten Sie Release Bestätigung Schritt 1 von QoS 2, Nachricht ID
ini_Receive_release_confirmation_step_3_of_QoS_2_message_ID=Erhalten Sie Release Bestätigung Schritt 3 von QoS 2, Nachricht ID
ini_Receive_release_confirmation_step_2_of_QoS_2_message_ID=Erhalten Sie Release Bestätigung Schritt 2 von QoS 2, Nachricht ID
ini_ConnectionTimedOut=Verbindungszeit abgelaufen
ini_PublishingTimeout=Veröffentlichungszeitraum
ini_MessageID=ID der Nachricht
ini_Topic=Thema
ini_Content=Inhalt
ini_CameraOn=Kamera an
ini_OpenFailed=Öffnen fehlgeschlagen
ini_NoVideoDevicesWereFound=Es wurden keine Videogeräte gefunden
ini_Stopped=Stoppt
ini_CameraStartFailed=Start der Kamera fehlgeschlagen
ini_CameraOff=Kamera aus
ini_Disconnect=Trennen
ini_Started=Angefangen
ini_Failed_to_start_Please_try_another_port=Fehler beim Starten. Bitte versuchen Sie einen anderen Port
ini_Minimum_desktop_requirements_Windows_Vista=Mindestanforderungen an den Desktop: Windows Vista
ini_Minimum_server_requirements_Windows_Server_2008=Mindestanforderungen an den Server: Windows Server 2008








ini_Table_structure_field_type=Typ des Tabellenstruktur-Feldes ftblob (Base64-Format), ftstring, ftinteger, ftboolean, ftfloat, ftcurrency, ftdatetime,
ini_size_ftString_ftInteger_ftBlob=Größe (ftstring wird auf die tatsächliche Länge gesetzt, andere werden auf 0 gesetzt, zum Beispiel ist ftinteger ftblob auf 0 gesetzt)
ini_Currently_10_tables_are_supported=Derzeit werden 10 Tabellen abcdefghij unterstützt. Tabelle a enthält zum Beispiel ein Feld adata, bis Tabelle J jfield jdata enthält





ini_ParameterSetting=Einstellung der Parameter
ini_Log_save_path_if_empty_the_default_is_log_directory=Log Speicherpfad (wenn leer, ist standardmäßig Log-Verzeichnis)
ini_Clear_log_on_startup=Löschen beim Start
ini_Clear_log_on_exit=Löschen beim Beenden
ini_In_operation_every=Während des Betriebs einmal alle XX Minuten leer
ini_Save_settings=Einstellungen speichern
ini_journal=Zeitschrift
ini_report_form=Formular des Berichts
ini_Report_template_path_empty_default_report_directory=Vorlage-Pfad melden (leeres Standardreport-Verzeichnis)
ini_Export_file_path_empty_default_export_directory=Dateipfad exportieren (leeres Standard-Exportverzeichnis)
ini_Export_file_format_blank_default_PDF_format=Dateiformat exportieren (blank, Standard PDF Format)
ini_Enable_token=Aktivieren Sie Token
ini_Token_list_one_for_each_line_similar_to_white_list=Token-Liste (eine für jede Zeile, ähnlich der weißen Liste)
ini_other=andere
ini_Minimize_after_startup=Minimieren nach dem Start
ini_Customize_the_client_name_so_that_it_can_start_multiple_clients=Anpassen des Kundennamens, so dass mehrere Clients gestartet werden können






ini_URL_encoding_decoding=Kodierung der URL
ini_URLEncode=URLEncode
ini_URLDecode=Dekodierung von URLDecode


ini_Base64_and_image_conversion=Base64 und Bildkonvertierung
ini_exceed_100k=Um die Effizienz in der Produktionsumgebung auszugleichen, sollte in der Regel eine einzelne Bilddatei 100k nicht überschreiten.
ini_Base64_string=Base64 string
ini_paste=Einfügen
ini_Turn_to_picture=Bild drehen
ini_picture=Bild


ini_Connection=connect
ini_write_log=Protokolle generieren